uliano/brio/brio/stm32g0/device_tables.hpp
constexpr UsartBusClock usart_bus_clock(uint8_t n) {
    switch (n) {
#if defined(RCC_APBENR2_USART1EN)
        case 1: return {true, RCC_APBENR2_USART1EN};
#endif
#if defined(RCC_APBENR1_USART2EN)
        case 2: return {false, RCC_APBENR1_USART2EN};
#endif
#if defined(RCC_APBENR1_USART3EN)
        case 3: return {false, RCC_APBENR1_USART3EN};
#endif
#if defined(RCC_APBENR1_USART4EN)
        case 4: return {false, RCC_APBENR1_USART4EN};
#endif
#if defined(RCC_APBENR1_USART5EN)
        case 5: return {false, RCC_APBENR1_USART5EN};
#endif
#if defined(RCC_APBENR1_USART6EN)
        case 6: return {false, RCC_APBENR1_USART6EN};
#endif
        default: return {};
    }
}

/// Position of USARTn's kernel-clock select field in RCC_CCIPR, or 0xFF
/// when the instance has no multiplexer (it then runs on PCLK, full
/// stop). USART1's field sits at bit 0, so the "absent" code cannot be 0.
constexpr uint8_t usart_clock_select_pos(uint8_t n) {
    switch (n) {
#if defined(RCC_CCIPR_USART1SEL_Pos)
        case 1: return RCC_CCIPR_USART1SEL_Pos;
#endif
#if defined(RCC_CCIPR_USART2SEL_Pos)
        case 2: return RCC_CCIPR_USART2SEL_Pos;
#endif
#if defined(RCC_CCIPR_USART3SEL_Pos)
        case 3: return RCC_CCIPR_USART3SEL_Pos;
#endif
        default: return 0xFF;
    }
}

constexpr bool usart_has_clock_select(uint8_t n) { return usart_clock_select_pos(n) != 0xFF; }

/// The NVIC line of USARTn. IRQn_Type values are enumerators and cannot
/// be probed, so the family's vector sharing is DERIVED FROM PRESENCE:
/// the enumerator's name lists what shares the line, and a header
/// declares the shared name exactly when it declares the sharer. USART2
/// shares its line with LPUART2 where there is one (the G0B1/G0C1);
/// USART3..6 sit on ONE line, whose name grows with the instance count
/// and with LPUART1 - USART3_4 on the G070, USART3_4_LPUART1 on the
/// G071/G081, USART3_4_5_6 on the G0B0, USART3_4_5_6_LPUART1 on the
/// G0B1/G0C1. A header that named things otherwise would fail to
/// compile here, never bind a wrong line: a wrong line would be a
/// silent Default_Handler spin (the samc21 stratum's NMI lesson), which
/// is also why the family fixture instantiates every present instance
/// on every header the pack ships. NonMaskableInt_IRQn for an instance
/// the device has not got - unreachable, Usart<n> refusing it first.
constexpr IRQn_Type usart_irq(uint8_t n) {
    switch (n) {
        case 1: return USART1_IRQn;
#if defined(LPUART2_BASE)
        case 2: return USART2_LPUART2_IRQn;
#else
        case 2: return USART2_IRQn;
#endif
#if defined(USART5_BASE) && defined(LPUART1_BASE)
        case 3: case 4: case 5: case 6: return USART3_4_5_6_LPUART1_IRQn;
#elif defined(USART5_BASE)
        case 3: case 4: case 5: case 6: return USART3_4_5_6_IRQn;
#elif defined(USART3_BASE) && defined(LPUART1_BASE)
        case 3: case 4: return USART3_4_LPUART1_IRQn;
#elif defined(USART3_BASE)
        case 3: case 4: return USART3_4_IRQn;
#endif
        default: return NonMaskableInt_IRQn;
    }
}

/// Whether USARTn carries the FULL feature set of table 183/184 - the
/// FIFOs, the PRESC prescaler, the kernel-clock multiplexer and the wake
/// from Stop, synchronous mode, smartcard, IrDA, LIN, auto-baud, the
/// receiver time-out and Modbus. A BASIC instance has none of them and
/// the rest of the chapter alike.
///
/// THIS IS A STATED TABLE AND NOT A HEADER PROBE, and the reason is that
/// the device header expresses the split as POINTER-COMPARISON macros -
/// IS_UART_FIFO_INSTANCE(x), IS_UART_AUTOBAUDRATE_DETECTION_INSTANCE(x)
/// and their kin, each of them `((x) == USART1)` and none of them a
/// constant expression. What CAN be probed is the instance count, and
/// the split rides on it: the FULL instances are the first HALF of the
/// roster - USART1 of two, USART1..2 of four, USART1..3 of six - which
/// is what the twelve headers' own IS_UART_FIFO_INSTANCE macros spell
/// out one by one (G03x/G04x/G05x/G06x: USART1; G07x/G08x: USART1..2;
/// G0Bx/G0C1: USART1..3) and what table 183 states. The SILICON is the
/// check: test_stm32_serial's letter a writes FIFOEN and PRESC on every
/// present instance and compares what sticks against this function.
/// (ES0548 2.11.2 is the documentation erratum saying some manual
/// revisions omit the prescaler's own per-instance split; the
/// implementation section carries it and so does this table.)
constexpr bool usart_is_full(uint8_t n) {
    if (!usart_present(n)) {
        return false;
    }
#if defined(USART5_BASE)
    return n <= 3;      // USART1..3 FULL, USART4..6 BASIC
#elif defined(USART3_BASE)
    return n <= 2;      // USART1..2 FULL, USART3..4 BASIC
#else
    return n == 1;      // USART1 FULL, USART2 BASIC
#endif
}

/// The EXTI line USARTn's wake-up event raises (table 65: 24, 25 and 26
/// for USART3, USART1 and USART2, all DIRECT - no trigger selection, no
/// pending bit of the EXTI's own, the peripheral's WUF being the pending
/// state). 0xFF for an instance with no wake at all - which is every
/// BASIC one, table 184's last row. The NUMBERS are the MANUAL'S, like
/// lptim_exti_line()'s and rtc_exti_line's.
constexpr uint8_t usart_exti_line(uint8_t n) {
    if (!usart_is_full(n)) {
        return 0xFF;
    }
    switch (n) {
        case 1: return 25;
        case 2: return 26;
        case 3: return 24;
        default: return 0xFF;
    }
}

// ---- LPUART instances -------------------------------------------------------
//
// A DIFFERENT PERIPHERAL sharing the USART's register layout (the header
// gives both a USART_TypeDef): chapter 34 is chapter 33 minus the
// synchronous, smartcard, IrDA, LIN, Modbus, receiver-timeout and
// auto-baud halves, minus OVER8 - and PLUS a baud generator of its own
// (256 x fck / LPUARTDIV, 34.4.7), which is why it gets its own driver
// and its own probes rather than a template argument of the USART's.

/// Register block base of LPUARTn (n = 1..2), 0 when absent. LPUART1 is
/// on every G0; LPUART2 is the G0B1/G0C1's alone.
constexpr uint32_t lpuart_base(uint8_t n) {
    switch (n) {
#if defined(LPUART1_BASE)
        case 1: return LPUART1_BASE;
#endif
#if defined(LPUART2_BASE)
        case 2: return LPUART2_BASE;
#endif
        default: return 0;
    }
}

constexpr bool lpuart_present(uint8_t n) { return lpuart_base(n) != 0u; }

/// Which APB enable register carries LPUARTn, and which bit. BOTH sit on
/// APBENR1 on this family (LPUART1 at bit 20, LPUART2 at bit 7) - the
/// header is the authority and the answer is not what the USART's
/// APB2/APB1 split invites one to guess.
constexpr UsartBusClock lpuart_bus_clock(uint8_t n) {
    switch (n) {
#if defined(RCC_APBENR1_LPUART1EN)
        case 1: return {false, RCC_APBENR1_LPUART1EN};
#endif
#if defined(RCC_APBENR1_LPUART2EN)
        case 2: return {false, RCC_APBENR1_LPUART2EN};
#endif
        default: return {};
    }
}

/// Position of LPUARTn's kernel-clock select field in RCC_CCIPR
/// (LPUART1SEL at bit 10, LPUART2SEL at bit 8), or 0xFF when absent.
/// EVERY LPUART HAS ONE - unlike the USARTs, where only the FULL
/// instances do.
constexpr uint8_t lpuart_clock_select_pos(uint8_t n) {
    switch (n) {
#if defined(RCC_CCIPR_LPUART1SEL_Pos)
        case 1: return RCC_CCIPR_LPUART1SEL_Pos;
#endif
#if defined(RCC_CCIPR_LPUART2SEL_Pos)
        case 2: return RCC_CCIPR_LPUART2SEL_Pos;
#endif
        default: return 0xFF;
    }
}

/// The NVIC line of LPUARTn, derived from PRESENCE for the same reason
/// usart_irq()'s is: IRQn_Type values are enumerators. LPUART1 shares
/// USART3's line wherever there IS a USART3 (the G071/G081's USART3_4_
/// LPUART1, the G0B1/G0C1's USART3_4_5_6_LPUART1) and has a line of its
/// own where there is not (the G031/G041/G051/G061); LPUART2 shares
/// USART2's. NonMaskableInt_IRQn for an instance the device has not
/// got - unreachable, Lpuart<n> refusing it first.
constexpr IRQn_Type lpuart_irq(uint8_t n) {
    switch (n) {
#if defined(LPUART1_BASE) && defined(USART3_BASE)
        case 1: return usart_irq(3);
#elif defined(LPUART1_BASE)
        case 1: return LPUART1_IRQn;
#endif
#if defined(LPUART2_BASE)
        case 2: return usart_irq(2);
#endif
        default: return NonMaskableInt_IRQn;
    }
}

/// The EXTI line LPUARTn's wake-up event raises (table 65: 28 for
/// LPUART1, 35 for LPUART2 - the second one in the SECOND register
/// group, which only the G0B1 class has). The manual's numbers again.
constexpr uint8_t lpuart_exti_line(uint8_t n) {
    if (!lpuart_present(n)) {
        return 0xFF;
    }
    return n == 1 ? 28 : 35;
}

// ---- IRTIM (ch. 27) ---------------------------------------------------------

/// Which USART instance SYSCFG_CFGR1.IR_MOD code 10 selects as the
/// infrared modulation envelope: USART4 where the part has one (the
/// G07x/G08x/G0Bx/G0C1), USART2 otherwise (ch. 27's own note, repeated
/// in 6.1.3's IR_MOD description) - so the rule is the instance's own
/// presence, and every G0 has at least USART2. Code 01 is USART1
/// everywhere and needs no table.
constexpr uint8_t irtim_second_usart() {
#if defined(USART4_BASE)
    return 4;
#else
    return 2;
#endif
}

// ---- FLASH ------------------------------------------------------------------
//
// What differs across the family in chapter 3 is the SECOND BANK and the
// two protection units that come with the bigger parts - and, on the x0
// VALUE LINE, a whole list of option bits and registers that are simply
// not there: no programmable BOR, no NRST_MODE, no IRHEN, no nRST_SHDW,
// no PCROP, no securable memory, no RDERR (there being no PCROP to
// violate), no DBG_SWEN. The device header says so three ways and all
// three are probed here rather than in flash.hpp: a feature macro
// (FLASH_DBANK_SUPPORT and friends), the presence of a bit mask
// (FLASH_CR_BKER exists only where a bank may be selected; a mask that
// is absent is exported as 0, which every verb reads as "not on this
// part"), and - the one a mask cannot express - the presence of a
// STRUCT MEMBER: FLASH_TypeDef carries ECC2R and the four bank-2
// protection registers on dual-bank parts only, so a driver naming
// FLASH->ECC2R would not compile on a G031 at all. Those are exported
// as POINTERS, null where the register does not exist, which is the
// value form of "does this exist" and keeps the driver free of #ifdef.
// (SECR and the bank-1 PCROP registers, which the value line lacks, are
// the exception - see the note at the bank-2 pointers.)

